{
  "generated": "2026-02-28T23:33:00Z",
  "counts": {
    "skills": 15,
    "agents": 4,
    "commands": 45,
    "hooks": 8,
    "mcp_servers": 1,
    "review": 2,
    "workflow": 2
  },
  "skills": [
    {
      "name": "code-review-discipline",
      "description": "Use when requesting or receiving code review — covers dispatching reviewer subagents, handling feedback with technical rigor, and avoiding performative agreement"
    },
    {
      "name": "dispatching-parallel-agents",
      "description": "Use when facing 2+ independent tasks that can be worked on without shared state or sequential dependencies"
    },
    {
      "name": "engineering-docs",
      "description": "Use when capturing a solved problem as categorized documentation with YAML frontmatter for fast lookup"
    },
    {
      "name": "executing-plans",
      "description": "Use when you have a written implementation plan to execute in a separate session with review checkpoints"
    },
    {
      "name": "file-todos",
      "description": "This skill should be used when managing the file-based todo tracking system in the todos/ directory. It provides workflows for creating todos, managing status and dependencies, conducting triage, and integrating with slash commands and code review processes."
    },
    {
      "name": "galiana",
      "description": "Show discipline analytics — defect escape rate, override rate, cost metrics, and agent scorecard"
    },
    {
      "name": "interserve",
      "description": "Dispatch tasks to Codex CLI agents — single megaprompt for one task, parallel delegation for many. Includes structured debate triggers and Oracle escalation."
    },
    {
      "name": "landing-a-change",
      "description": "Use when implementation is complete and all tests pass — guides the disciplined process of verifying, documenting, and landing a change on trunk"
    },
    {
      "name": "lane",
      "description": "Manage thematic work lanes — discover, create, tag beads, show velocity and starvation scores"
    },
    {
      "name": "refactor-safely",
      "description": "Use when performing significant refactoring — guides a disciplined process that leverages duplication detection, characterization tests, staged execution, and continuous simplicity review"
    },
    {
      "name": "subagent-driven-development",
      "description": "Use when executing implementation plans with independent tasks in the current session"
    },
    {
      "name": "upstream-sync",
      "description": "Use when checking for updates from upstream tool repos (beads, oracle, superpowers, compound-engineering) or when the /clavain:upstream-sync command is invoked"
    },
    {
      "name": "using-clavain",
      "description": "Use when starting any conversation - establishes how to find and use skills, agents, and commands, requiring Skill tool invocation before ANY response including clarifying questions"
    },
    {
      "name": "using-tmux-for-interactive-commands",
      "description": "Use when you need to run interactive CLI tools (vim, git rebase -i, Python REPL, etc.) that require real-time input/output - provides tmux-based approach for controlling interactive sessions through detached sessions and send-keys"
    },
    {
      "name": "writing-plans",
      "description": "Use when you have a spec or requirements for a multi-step task, before touching code"
    }
  ],
  "agents": [
    {
      "name": "data-migration-expert",
      "description": "Validates data migrations, backfills, and production data transformations against reality. Use when PRs involve ID mappings, column renames, enum conversions, or schema changes.",
      "category": "review"
    },
    {
      "name": "plan-reviewer",
      "description": "Use this agent when a major project step has been completed and needs to be reviewed against the original plan and coding standards. Examples: <example>Context: The user is creating a code-review agent that should be called after a logical chunk of code is written. user: \"I've finished implementing the user authentication system as outlined in step 3 of our plan\" assistant: \"Great work! Now let me use the plan-reviewer agent to review the implementation against our plan and coding standards\" <commentary>Since a major project step has been completed, use the plan-reviewer agent to validate the work against the plan and identify any issues.</commentary></example> <example>Context: User has completed a significant feature implementation. user: \"The API endpoints for the task management system are now complete - that covers step 2 from our architecture document\" assistant: \"Excellent! Let me have the plan-reviewer agent examine this implementation to ensure it aligns with our plan and follows best practices\" <commentary>A numbered step from the planning document has been completed, so the plan-reviewer agent should review the work.</commentary></example>",
      "category": "review"
    },
    {
      "name": "bug-reproduction-validator",
      "description": "Systematically reproduces and validates bug reports to confirm whether reported behavior is an actual bug. Use when you receive a bug report or issue that needs verification.",
      "category": "workflow"
    },
    {
      "name": "pr-comment-resolver",
      "description": "Addresses PR review comments by implementing requested changes and reporting resolutions. Use when code review feedback needs to be resolved with code changes.",
      "category": "workflow"
    }
  ],
  "commands": [
    {
      "name": "brainstorm",
      "description": "Collaborative brainstorm workflow — explore ideas through structured dialogue (assess clarity, research repo, explore approaches, capture design) with auto-handoff to /write-plan."
    },
    {
      "name": "changelog",
      "description": "Create engaging changelogs for recent merges to main branch"
    },
    {
      "name": "clodex-toggle",
      "description": "Toggle interserve execution mode"
    },
    {
      "name": "codex-bootstrap",
      "description": "Bootstrap or check Clavain Codex installation health (install + wrapper sync + doctor)"
    },
    {
      "name": "compound",
      "description": "Document a recently solved problem to compound your team's knowledge"
    },
    {
      "name": "create-agent-skill",
      "description": "Create or edit Claude Code skills with expert guidance on structure and best practices"
    },
    {
      "name": "debate",
      "description": "Run a structured Claude↔Codex debate before implementing a complex task"
    },
    {
      "name": "distill",
      "description": "Synthesize accumulated docs into categorized solutions and generate missing SKILL-compact.md files"
    },
    {
      "name": "doctor",
      "description": "Quick health check — verifies MCP servers, external tools, beads, and plugin configuration without making changes"
    },
    {
      "name": "execute-plan",
      "description": "Execute plan in batches with review checkpoints"
    },
    {
      "name": "fixbuild",
      "description": "Run build, capture error, fix it, re-run — fast loop for type errors and build failures without heavyweight debugging"
    },
    {
      "name": "galiana",
      "description": "Discipline analytics — view KPIs, report defects, or reset cache"
    },
    {
      "name": "generate-command",
      "description": "Create a new custom slash command following conventions and best practices"
    },
    {
      "name": "heal-skill",
      "description": "Fix incorrect SKILL.md files when a skill has wrong instructions or outdated API references"
    },
    {
      "name": "help",
      "description": "Show Clavain commands organized by daily drivers first, then by workflow stage"
    },
    {
      "name": "init",
      "description": "Scaffold .clavain/ agent memory directory in the current project"
    },
    {
      "name": "interpeer",
      "description": "Quick cross-AI peer review — auto-detects host agent and calls the other for a second opinion"
    },
    {
      "name": "interserve",
      "description": "Run Codex-first execution flow for larger scope work"
    },
    {
      "name": "land",
      "description": "Run the landing workflow for trunk-based handoff"
    },
    {
      "name": "migration-safety",
      "description": "Orchestrate database migration and data-risk work with consistent safety checks — combines data integrity, migration, and deployment verification agents"
    },
    {
      "name": "model-routing",
      "description": "Toggle subagent model routing between economy (smart defaults) and quality (all opus) mode"
    },
    {
      "name": "plan-review",
      "description": "Have multiple specialized agents review a plan in parallel"
    },
    {
      "name": "pr-triage",
      "description": "Triage all open PRs — batch by theme, review with parallel agents, generate report, walk through decisions"
    },
    {
      "name": "quality-gates",
      "description": "Auto-select and run the right reviewer agents based on what changed — one command for comprehensive quality review"
    },
    {
      "name": "refactor",
      "description": "Plan and execute safe refactors with explicit risk controls"
    },
    {
      "name": "reflect",
      "description": "Capture sprint learnings and advance from reflect to done"
    },
    {
      "name": "repro-first-debugging",
      "description": "Disciplined bug investigation that enforces \"reproduce first, then diagnose\" — composes debugging agents into a structured workflow"
    },
    {
      "name": "resolve",
      "description": "Resolve findings from any source — auto-detects TODOs, PR comments, or todo files, then resolves in parallel"
    },
    {
      "name": "review",
      "description": "Perform exhaustive code reviews using multi-agent analysis and deep inspection"
    },
    {
      "name": "review-discipline",
      "description": "Run disciplined code review and feedback triage"
    },
    {
      "name": "review-doc",
      "description": "Quick single-pass document refinement — assess clarity, score quality, fix issues, offer iteration"
    },
    {
      "name": "route",
      "description": "Universal entry point — discovers work, resumes sprints, classifies tasks, and dispatches to /sprint or /work"
    },
    {
      "name": "setup",
      "description": "Bootstrap Clavain for the active runtime (Codex or Claude Code) and verify health"
    },
    {
      "name": "smoke-test",
      "description": "Run smoke tests against a running app — detect dev server, walk critical user journeys, report results"
    },
    {
      "name": "sprint",
      "description": "Phase sequencer — brainstorm, strategize, plan, execute, review, ship. Use /route for smart dispatch."
    },
    {
      "name": "sprint-status",
      "description": "Deep scan of sprint workflow state — session continuity, pipeline health, plan progress, beads, and recommendations"
    },
    {
      "name": "status",
      "description": "Unified status view across Clavain, artifact generation, doc drift, and coordination"
    },
    {
      "name": "strategy",
      "description": "Structure brainstorm output into a PRD with features, create beads for tracking, and validate before detailed planning"
    },
    {
      "name": "tdd",
      "description": "Run disciplined test-driven development (RED-GREEN-REFACTOR) for a task"
    },
    {
      "name": "todos",
      "description": "Create and maintain file-based todo tracking"
    },
    {
      "name": "triage",
      "description": "Triage and categorize findings for the CLI todo system"
    },
    {
      "name": "upstream-sync",
      "description": "Check upstream repos (beads, oracle, superpowers, compound-engineering) for updates and generate upgrade checklist"
    },
    {
      "name": "verify",
      "description": "Run completion verification before claiming work is done"
    },
    {
      "name": "work",
      "description": "Execute work plans efficiently while maintaining quality and finishing features"
    },
    {
      "name": "write-plan",
      "description": "Create detailed implementation plan with bite-sized tasks"
    }
  ]
}
